In [2]:
# 판다스의 데이터 구조를 알고, 데이터프레임을 만들수 있다.

In [3]:
## Pandas란?
# -> 파이썬에서 데이터를 조작/분석 하기 위한 라이브러리
# - 행/열로 이루어진 테이블 형태의 데이터를 다룬다.
# - 엑셀로 다루지못하는 대용량 데이터를 다룰 수 있다. 
# - Matploptlib, Seaborn등 다양한 시각화 도구와 함께 사용할 수 있다.

In [4]:
# 판다스에서는 Series와 DataFrame의 형태로 데이터를 다룬다.
# Series -> 1차원 리스트 형태
# DataFrame -> 2차원 표 형태

# Pandas 라이브러리 import
* pandas는 외부 패키지이지만 아나콘다에 기본적으로 설치되어 제공되기 때문에 별도 설치할 필요가 없다.
* pandas는 관용적으로 pd라는 별칭을 사용한다.

In [5]:
import pandas as pd

In [6]:
# DataFrame : 행, 열로 이루어진 2차원 표 형태
# 행(row) : index로 구분
# 열(series, column) : column_name으로 구분

#      a    b    c
# 1    4    7    10
# 2    5    8    11
# 3    6    9    12
# -> 1,2,3 (인덱스) ## 리스트의 인덱스와는 조금 다르다
# -> a,b,c (속성,컬럼명)

# 데이터프레임 만들기
* 데이터프레임 : 엑셀의 시트(sheet)와 동일한 개념이다.(2차원 표 형태)

## 리스트로 만들기
* pd.DataFrame(2차원리스트,cloumns=컬럼리스트,index=인덱스리스트)
* 행 단위로 데이터프레임이 생성된다.
* 컬럼인덱스를 지정하지 않으면 디폴트로 0부터 시작하는 숫자가 지정된다.

In [8]:
    [
        ['james',30,'programmer'],
        ['amy',20,'student'],
        ['david',25,'designer']
    ]
    
df = pd.DataFrame(  # 판다스로 만들게되면 이렇게 표 형태로 볼 수 있다.
        [
            ['james',30,'programmer'],
            ['amy',20,'student'],
            ['david',25,'designer']
        ])
df

       0   1           2
0  james  30  programmer
1    amy  20     student
2  david  25    designer

In [15]:
df1 = pd.DataFrame(
        [
            ['james',30,'programmer'],
            ['amy',20,'student'],
            ['david',25,'designer']
        ],
        columns=['name','age','job'],
        index=['a','b','c']
        )
df1

    name  age         job
a  james   30  programmer
b    amy   20     student
c  david   25    designer

## 딕셔너리로 만들기
* pd.DataFrame(딕셔너리,index=인덱스리스트)
* 딕셔너리는 {컬럼명1:컬럼값리스트, 컬럼명2:컬럼값리스트, ... }
* 컬럼 단위로 데이터프레임이 생성된다.
* 딕셔너리의 키가 컬럼명이 된다.
* 인덱스를 지정하지 않으면 디폴트로 0부터 시작하는 숫자가 지정된다.

In [21]:
df3 = pd.DataFrame(
    {'name':['james','amy','david'],
     'age':[30,20,25],
     'job':['programmer','student','designer']
    },
    index = ['a','b','c']
)

df3

    name  age         job
a  james   30  programmer
b    amy   20     student
c  david   25    designer

## csv 파일에서 데이터를 읽어와 만들기
* pd.read_csv(파일경로)
* csv파일은 utf-8 형식이어야 한다.

In [22]:
# 1. 데이터파일준비하기 * UTF-8 형식의 csv파일 
# 2. 데이터파일을 읽어와 데이터프레임 만들기 # df = pd.read_csv('scores.csv')

In [9]:
df4 = pd.read_csv('data/scores.csv')
df4

        name    kor    eng   math
0      Aiden  100.0   90.0   95.0
1    Charles   90.0   80.0   75.0
2     Danial   95.0  100.0  100.0
3       Evan  100.0  100.0  100.0
4      Henry    NaN   35.0   60.0
5        Ian   90.0  100.0   90.0
6      James   70.0   75.0   65.0
7     Julian   80.0   90.0   55.0
8     Justin   50.0   60.0  100.0
9      Kevin  100.0  100.0   90.0
10       Leo   90.0   95.0   70.0
11    Oliver   70.0   75.0   65.0
12     Peter  100.0   95.0  100.0
13       Amy   90.0   75.0   90.0
14     Chloe   95.0  100.0   95.0
15     Danna  100.0  100.0  100.0
16     Ellen    NaN   60.0    NaN
17      Emma   70.0   65.0   70.0
18  Jennifer   80.0   55.0   80.0
19      Kate   50.0    NaN   50.0
20     Linda  100.0   90.0  100.0
21    Olivia   90.0   70.0   90.0
22      Rose   70.0   65.0   70.0
23     Sofia  100.0  100.0  100.0
24   Tiffany   90.0    NaN   90.0
25   Vanessa   95.0   70.0   95.0
26   Viviana  100.0   80.0  100.0
27    Vikkie    NaN   50.0  100.0
28    Winnie   70.0  100.0   70.0
29      Zuly   80.0   90.0   95.0

# 데이터 미리보기

## 가장 앞의 n행보기 
* 데이터프레임.head(n)
* 시리즈.head(n)
* n을 생략하면 5개의 행을 출력한다.

In [35]:
import pandas as pd
df = pd.read_csv('data/scores.csv')
df

        이름   국어   영어     수학
0     kate  100   90   95.0
1   olivia   90   80   75.0
2     emma   95  100  100.0
3   sophia  100  100  100.0
4      amy   70   75   65.0
5    james   70   75   65.0
6   daniel   80   90   55.0
7    peter   50   60    NaN
8    kevin  100  100   90.0
9     jack   90   95   70.0
10   james   70   75   65.0

In [37]:
df.head(1)

     이름   국어  영어    수학
0  kate  100  90  95.0

## 가장 뒤의 n행 보기
* 데이터프레임.tail(n)
* n을 생략하면 5개의 행을 출력한다

In [38]:
df.tail()

        이름   국어   영어    수학
6   daniel   80   90  55.0
7    peter   50   60   NaN
8    kevin  100  100  90.0
9     jack   90   95  70.0
10   james   70   75  65.0

## 랜덤 보기

### 랜덤 n개데이터 보기 
* 데이터프레임.sample(n)
* n을 생략하면 1개의 샘플을 출력한다.

In [41]:
df.sample(3)

      이름   국어   영어     수학
2   emma   95  100  100.0
8  kevin  100  100   90.0
9   jack   90   95   70.0

### 랜덤 샘플 비율로 보기
* 데이터프레임.sample(frac=0.2)
* 지정한 비율의 샘플을 출력

In [44]:
df.sample(frac=0.3)

       이름   국어   영어     수학
1  olivia   90   80   75.0
8   kevin  100  100   90.0
3  sophia  100  100  100.0

## 높은순/낮은순 보기

### 높은순 보기
* 데이터프레임.nlargest(갯수,컬럼명)
* 컬럼의 데이터가 숫자형일 때 사용할 수 있다.

In [49]:
# eng 높은 순으로 5개 보기
df.nlargest(5,'영어')

       이름   국어   영어     수학
2    emma   95  100  100.0
3  sophia  100  100  100.0
8   kevin  100  100   90.0
9    jack   90   95   70.0
0    kate  100   90   95.0

### 낮은순 보기
* 데이터프레임.nsmallest(갯수,컬럼명)
* 컬럼의 데이터가 숫자형일때 사용할 수 있다.

In [50]:
# eng 낮은 순으로 5개 보기
df.nsmallest(5,'영어')

        이름  국어  영어    수학
7    peter  50  60   NaN
4      amy  70  75  65.0
5    james  70  75  65.0
10   james  70  75  65.0
1   olivia  90  80  75.0

# 데이터 요약 보기

## (행,열)의 크기보기
* 데이터프레임.shape

In [51]:
df.shape

(11, 4)

## 데이터의 갯수보기
* len(데이터프레임)

In [52]:
len(df)

11

## 컬럼명 보기
* 데이터프레임.columns
* 데이터프레임의 열 이름을 확인

In [53]:
df.columns

Index(['이름', '국어', '영어', '수학'], dtype='object')

## 인덱스 보기
* 데이터프레임.index
* 데이터프레임의 인덱스를 확인

In [54]:
df.index

RangeIndex(start=0, stop=11, step=1)

In [55]:
df

        이름   국어   영어     수학
0     kate  100   90   95.0
1   olivia   90   80   75.0
2     emma   95  100  100.0
3   sophia  100  100  100.0
4      amy   70   75   65.0
5    james   70   75   65.0
6   daniel   80   90   55.0
7    peter   50   60    NaN
8    kevin  100  100   90.0
9     jack   90   95   70.0
10   james   70   75   65.0

## 데이터의 자료형 보기
* 데이터프레임.dtypes
* 데이터프레임을 구성하는 값의 자료형을 확인한다
* 판다스에서는 문자열의 데이터타임이 object이다.

In [56]:
df.dtypes  # object형은 srt형이라고 생각하면 된다.

이름     object
국어      int64
영어      int64
수학    float64
dtype: object

## 데이터프레임정보 보기 
* 데이터프레임.info()
* 데이터프레임의 총 샘플 갯수, 컬럼 수, 컬럼 별 정보 등을 확인한다

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      11 non-null     object
 1   국어      11 non-null     int64
 2   영어      11 non-null     int64
 3   수학      10 non-null     float64
dtypes: float64(1), int64(2), object(1)
memory usage: 480.0+ bytes

## 컬럼의 유니크한 데이터 뽑기
* 컬럼.unique()

In [60]:
df['이름'].unique()

array(['kate', 'olivia', 'emma', 'sophia', 'amy', 'james', 'daniel',
       'peter', 'kevin', 'jack'], dtype=object)

In [61]:
df['수학'].unique()

array([ 95.,  75., 100.,  65.,  55.,  nan,  90.,  70.])

## 컬럼의 유니크한 값의 갯수 보기
* 컬럼.value_counts()

In [62]:
df['수학'].value_counts()

65.0     3
100.0    2
95.0     1
75.0     1
55.0     1
90.0     1
70.0     1
Name: 수학, dtype: int64

## 요약통계 보기

In [64]:
df.describe()

               국어          영어          수학
count   11.000000   11.000000   10.000000
mean    83.181818   85.454545   78.000000
std     16.473119   13.314380   16.699967
min     50.000000   60.000000   55.000000
25%     70.000000   75.000000   65.000000
50%     90.000000   90.000000   72.500000
75%     97.500000   97.500000   93.750000
max    100.000000  100.000000  100.000000

In [66]:
df['이름'].count()

11

In [69]:
df['국어'].mean() # 평균값

83.18181818181819